import React, { useState } from 'react';

const FAQ = () => {
    const faqData = [
        {
            question: 'آیا می‌توانم بعد از خرید بلیت، صندلی خود را عوض کنم؟',
            answer: 'به‌طورکلی امکان جابجایی صندلی پس از خرید بلیت وجود ندارد. اما شما می‌توانید بلیت خود را لغو کنید و دوباره بلیت دلخواه خود را خریداری کنید.',
        },
        {
            question: 'تا چه زمانی فرصت دارم بلیت فیلم یا تئاتری که خریده‌ام را لغو کنم؟',
            answer: 'شما می‌توانید بلیت فیلم‌های سینما را تا 2 ساعت قبل از شروع سانس لغو کنید. همچنین می‌توانید بلیت تئاتر را تا 3 ساعت قبل از شروع آن، لغو کنید. بعد از لغو بلیت، هزینه آن به کیف پول شما باز می‌گردد.',
        },
        {
            question: 'هزینه بلیتی که لغو کرده‌ام، چطور به حساب من باز می‌گردد؟',
            answer: 'پس از لغو بلیت فیلم یا تئاتر، هزینه آن به کیف پول شما در سامانه باز می‌گردد. می‌توانید از موجودی کیف پول خود برای خریدهای بعدی استفاده کنید یا موجودی کیف پول را به حساب بانکی خود انتقال دهید.',
        },
        {
            question: 'چرا بعد از خرید بلیت، مبلغ از حساب من کم شده اما کد رزرو برایم پیامک نشده است؟',
            answer: 'اگر کد رزرو برای شما پیامک نشده، از طریق بخش «بلیت‌های من» می‌توانید بلیت خود را مشاهده کنید. در صورتی که در این بخش نیز امکان مشاهده بلیت خریداری شده را نداشتید، به این معنی است که تراکنش شما ناموفق بوده و مبلغ کم‌شده از حسابتان نهایتا تا 72 ساعت کاری ازطرف بانک به حساب شما باز می‌گردد.',
        },
        {
            question: 'در سالن سینما، چطور بلیت خود را به سینمادار ارایه دهم؟',
            answer: 'در سالن‌های سینما یا تئاتر، یک دستگاه وجود دارد که شما باید کد رزرو خود را در آن وارد کنید، تا بلیت فیزیکی شما را چاپ کند و به شما تحویل دهد. سپس بلیت فیزیکی را به سینمادار دهید تا اجازه تماشای فیلم یا تئاتر به شما داده شود.',
        },
    ];

    const [openQuestionIndex, setOpenQuestionIndex] = useState(null);

    const toggleQuestion = (index) => {
        setOpenQuestionIndex(openQuestionIndex === index ? null : index);
    };

    return (
        <div className="container mt-4">
            <h2>سوالات متداول</h2>
            {faqData.map((faq, index) => (
                <div key={index} className="mb-3">
                    <button
                        className="btn btn-white border-danger shadow-sm w-100" // Added w-100 class for fixed width
                        onClick={() => toggleQuestion(index)}
                    >
                        {faq.question}
                    </button>
                    {openQuestionIndex === index && (
                        <div className="mt-3">
                            <p>{faq.answer}</p>
                        </div>
                    )}
                </div>
            ))}
        </div>
    );
};

export default FAQ;
